tutorials/ShearDeform/FTShearDeformDMR/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdmfFTFoam; 

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1.0e-7;

//writeControl    timeStep;
writeControl    adjustableRunTime;

writeInterval   1; 

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression yes;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.1; //0.2
maxAlphaCo      0.2;

maxDeltaT       0.001; //0.01
dimensionSet    0;



